In [1]:
import pandas as pd
import numpy as np

In [3]:
rng = np.random.RandomState(42)
sr = pd.Series(rng.randint(0,10,4))
sr

0    6
1    3
2    7
3    4
dtype: int32

In [5]:
df = pd.DataFrame(rng.randint(0,10,(3,4)),
                  columns=['A','B','C','D']
                 )
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [6]:
np.exp(sr)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [7]:
np.sin(df*np.pi/4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [8]:
""" Ufuncs: Index alignment """
# index alignment in series
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [9]:
population/area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [10]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [12]:
A = pd.Series([1,2,3], index=[1,2,3])
B = pd.Series([1,2,3], index=[0,1,2])
A + B

0    NaN
1    3.0
2    5.0
3    NaN
dtype: float64

In [13]:
A.add(B, fill_value=0)

0    1.0
1    3.0
2    5.0
3    3.0
dtype: float64

In [14]:
""" Index Alignment in DataFrame """
A = pd.DataFrame(rng.randint(0,20,(2,2)), columns=list('AB'))
A

   A   B
0  1  11
1  5   1

In [18]:
B = pd.DataFrame(rng.randint(0,20,(3,3)), columns=list('BAC'))
B

   B   A   C
0  4  18   6
1  8   6  17
2  3  13  17

In [19]:
A+B

      A     B   C
0  19.0  15.0 NaN
1  11.0   9.0 NaN
2   NaN   NaN NaN

In [20]:
A.add(B, fill_value=0)

      A     B     C
0  19.0  15.0   6.0
1  11.0   9.0  17.0
2  13.0   3.0  17.0

In [25]:
fill=A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0  19.0  15.0  10.5
1  11.0   9.0  21.5
2  17.5   7.5  21.5

In [ ]:
""" Operations between Series and DataFrame """

In [27]:
A = rng.randint(10,size=(3,4))
A

array([[9, 8, 9, 4],
       [1, 3, 6, 7],
       [2, 0, 3, 1]])

In [28]:
A-A[0]

array([[ 0,  0,  0,  0],
       [-8, -5, -3,  3],
       [-7, -8, -6, -3]])

In [29]:
df = pd.DataFrame(A,columns=list('QRST'))
df

   Q  R  S  T
0  9  8  9  4
1  1  3  6  7
2  2  0  3  1

In [30]:
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -8 -5 -3  3
2 -7 -8 -6 -3

In [31]:
# column- wise
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  1  0  1 -4
1 -2  0  3  4
2  2  0  3  1

In [32]:
halfthrow = df.iloc[0::2]
halfthrow

   Q  R  S  T
0  9  8  9  4
2  2  0  3  1

In [33]:
df - halfthrow

     Q    R    S    T
0  0.0  0.0  0.0  0.0
1  NaN  NaN  NaN  NaN
2  0.0  0.0  0.0  0.0